<h1 align='center' style="color:red;"><u>|| Mean Encoding Technique ||</h1>
<br><br>
<font color='#045FB4'>
<h3>
    
- First find relation percent(%)of feature with respect to Target/Output feature (finding mean)
- Now, we replace category values with their mean with respect to target feature

<h3 style="color:#B4045F;">Import required Libraries <br>

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('Titanic.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<h3 style="color:#B4045F;">We perform Mean encoding on Cabin feature with respect to Survived feature<br>

In [3]:
data = data[['Cabin','Survived']]
data.head()

  Cabin  Survived
0   NaN         0
1   C85         1
2   NaN         1
3  C123         1
4   NaN         0

<h3 style="color:#B4045F;"> Check null values<br>

In [4]:
data.isnull().sum()

Cabin       687
Survived      0
dtype: int64

In [5]:
data['Cabin'].fillna('Missing',inplace=True)
data.isnull().sum()

Cabin       0
Survived    0
dtype: int64

<h3 style="color:#B4045F;">
Now we fetch only cabin name and drop seat number 
</h3>
    <font color='blue'>
    
- Ex :
    - In C85 & C123 'C' is a cabin name and 85,123 is a seat number

In [6]:
data['Cabin'].head(10)

0    Missing
1        C85
2    Missing
3       C123
4    Missing
5    Missing
6        E46
7    Missing
8    Missing
9    Missing
Name: Cabin, dtype: object

In [7]:
data['Cabin'] =data['Cabin'].astype(str).str[0]
data.head(10)

  Cabin  Survived
0     M         0
1     C         1
2     M         1
3     C         1
4     M         0
5     M         0
6     E         0
7     M         0
8     M         1
9     M         1

<h3 style="color:#B4045F;"> Find Survived percent of each cabin <br>

In [8]:
cabin_labels = data.groupby(['Cabin'])['Survived'].mean().sort_values()
cabin_labels

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

<h3 style="color:#B4045F;"> Create a Dictionary of Cabin_labels<br>

In [10]:
cabin_Name_dict = cabin_labels.to_dict()
cabin_Name_dict

{'T': 0.0,
 'M': 0.29985443959243085,
 'A': 0.4666666666666667,
 'G': 0.5,
 'C': 0.5932203389830508,
 'F': 0.6153846153846154,
 'B': 0.7446808510638298,
 'E': 0.75,
 'D': 0.7575757575757576}

<h2 align='center',style="color:green;">
Now we perform Mean Encoding Technique

<h3 style="color:#B4045F;">At last, We replace or Map this mean with Cabin name <br>

In [11]:
data['Cabin_Label'] = data['Cabin'].map(cabin_Name_dict)

In [12]:
data.head(15)

   Cabin  Survived  Cabin_Label
0      M         0     0.299854
1      C         1     0.593220
2      M         1     0.299854
3      C         1     0.593220
4      M         0     0.299854
5      M         0     0.299854
6      E         0     0.750000
7      M         0     0.299854
8      M         1     0.299854
9      M         1     0.299854
10     G         1     0.500000
11     C         1     0.593220
12     M         0     0.299854
13     M         0     0.299854
14     M         0     0.299854

### Please let me know your feedback in comment section
#### Also, [take a look at my other notebooks](https://www.kaggle.com/rushikeshlavate/notebooks)
<h1 align='center' style="color:green;"><u>|| Thank you ! 😀😀 ||</h1>